vidhyamg/UWR-INTERNSHIP/Drivers/src/stm32f401xe_usart.c
/**
 * stm32f401xe_usart.c
 *  Created on: Aug 19, 2026
 *    @version 1.0
 **/

#include "stm32f401xe.h"
#include "stm32f401xe_usart.h"
#include "stm32f401xe_rcc.h"

/****************************BAUD RATE CALCULATION************************************************
 * @brief calculation formula:
 *               F_CK
Baud = ─────────────────────
       8 × (2 - OVER8) × USARTDIV

Where:
  F_CK = Peripheral clock (APB1 or APB2)
  OVER8 = Oversampling mode (0 = 16x, 1 = 8x)
  USARTDIV = DIV_Mantissa + (DIV_Fraction / 16)

Example: F_CK = 16 MHz, Baud = 115200, OVER8 = 0
  USARTDIV = 16,000,000 / (16 × 115200) = 8.6805
  
  Mantissa = 8
  Fraction = 0.6805 × 16 = 10.89 ≈ 11 (0xB)
  
  BRR = (8 << 4) | 11 = 0x8B
 */

 void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{
    uint32_t PCLKx;
    uint32_t usartdiv;
    uint32_t M_part, F_part;
    uint32_t tempreg = 0;

    // Get the APB clock value
    if (pUSARTx == USART1 || pUSARTx == USART6)
    {
        // USART1 and USART6 are on APB2
        //PCLKx = RCC_GetPCLK2Value();
    	PCLKx=16000000;
    }
    else
    {
        // USART2, USART3, UART4, UART5 are on APB1
        //PCLKx = RCC_GetPCLK1Value();
        PCLKx=16000000;
    }

    // Check OVER8 bit
    if (pUSARTx->CR1 & (1 << 15))
    {
        // OVER8 = 1, oversampling by 8
        usartdiv = ((25 * PCLKx) / (2 * BaudRate));
    }
    else
    {
        // OVER8 = 0, oversampling by 16
        usartdiv = ((25 * PCLKx) / (4 * BaudRate));
    }

    // Calculate mantissa
    M_part = usartdiv / 100;

    // Place mantissa in appropriate position
    tempreg |= M_part << 4;

    // Calculate fraction
    F_part = (usartdiv - (M_part * 100));

    // Calculate final fraction value
    if (pUSARTx->CR1 & (1 << 15))
    {
        // OVER8 = 1
        F_part = ((F_part * 8) + 50) / 100;
        F_part &= 0x07;  // Only 3 bits for OVER8
    }
    else
    {
        // OVER8 = 0
        F_part = ((F_part * 16) + 50) / 100;
        F_part &= 0x0F;  // 4 bits for normal mode
    }

    // Place fraction in lower 4 bits
    tempreg |= F_part;

    // Write to BRR
    pUSARTx->BRR = tempreg;
}

/*******************USART_Init Function************************************************
 * @brief  Initializes the USARTx peripheral according to the specified parameters
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  USART_InitStruct: Pointer to a USART_InitTypeDef structure that contains
 *         the configuration information for the specified USART peripheral.
 * @retval None
 */
void USART_Init(USART_Handle_t *pUSARTHandle)
{

	//Temporary variable
	uint32_t tempreg=0;  // Used to configure the CR1, CR2 and CR3 registers

/******************************** Configuration of CR1******************************************/

	//Implement the code to enable the Clock for given USART peripheral
	 USART_PeriClockControl(pUSARTHandle->pUSARTx,ENABLE);       

	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)     // RX only
	{
		//Implement the code to enable the Receiver bit field
		tempreg|= (1 << USART_CR1_RE);
	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		//Implement the code to enable the Transmitter bit field
		tempreg |= ( 1 << USART_CR1_TE );                                    // TX only

	}else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		//Implement the code to enable the both Transmitter and Receiver bit fields
		tempreg |= ( ( 1 << USART_CR1_RE) | ( 1 << USART_CR1_TE) );                // TX and RX both
	}

    //Implement the code to configure the Word length configuration item
	tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M ;      //8 or 9 bits


    //Configuration of parity control bit fields
	if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		//Implement the code to enable the parity control(PCE bit in CR1)
		tempreg |= ( 1 << USART_CR1_PCE);                     

		//Implement the code to enable EVEN parity
		//Not required because by default EVEN parity will be selected once you enable the parity control(PS=0)

	}else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		//Implement the code to enable the parity control(PCE bit in CR1)
	    tempreg |= ( 1 << USART_CR1_PCE);

	    //Implement the code to enable ODD parity(PS bit in CR1)
	    tempreg |= ( 1 << USART_CR1_PS);

	}

   //Program the CR1 register
	pUSARTHandle->pUSARTx->CR1 = tempreg;                   

/******************************** Configuration of CR2******************************************/

	tempreg=0;

	//Implement the code to configure the number of stop bits inserted during USART frame transmission
	tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;  // (0, 1, 2, 3 for 1, 0.5, 2, 1.5 stop bits)

	//Program the CR2 register
	pUSARTHandle->pUSARTx->CR2 = tempreg;

/******************************** Configuration of CR3******************************************/

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)   // CTS flow control
	{
		//Implement the code to enable CTS flow control
		tempreg |= ( 1 << USART_CR3_CTSE);                       


	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)       // RTS flow control
	{
		//Implement the code to enable RTS flow control
		tempreg |= ( 1 << USART_CR3_RTSE);

	}else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)    // CTS and RTS flow control
	{
		//Implement the code to enable both CTS and RTS Flow control
		tempreg |= ( 1 << USART_CR3_CTSE);
		tempreg |= ( 1 << USART_CR3_RTSE);
	}


	pUSARTHandle->pUSARTx->CR3 = tempreg;

/******************************** Configuration of BRR(Baudrate register)******************************************/

	//Implement the code to configure the baud rate(BRR register) using the function USART_SetBaudRate()
	USART_SetBaudRate(pUSARTHandle->pUSARTx,pUSARTHandle->USART_Config.USART_Baud);

}

/*****************USART_ENABLE/DISABLE functions *********************************
 * @brief  Enables or disables the specified USART peripheral
 * @param  pUSARTx: Pointer to the USART register structure 
 * @param  EnorDi: ENABLE or DISABLE macros
 * @retval None
 */

 void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t Cmd)    //Control the USART peripheral
{
	if(Cmd == ENABLE)
	{
		pUSARTx->CR1 |= (1 << 13);              // Set the UE bit to enable the USART peripheral
	}else
	{
		pUSARTx->CR1 &= ~(1 << 13);            // Clear the UE bit to disable the USART peripheral
	}
}

/*********************** USART_PERI_CLK_CONTROL ***************************************
 * @brief  Enables or disables the peripheral clock for the specified USART peripheral
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  EnorDi: ENABLE or DISABLE macros
 * @retval None
 */

 void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)  
{
	if(EnorDi == ENABLE)
	{
		if(pUSARTx == USART1)               // Check if the USART peripheral is USART1
		{
			USART1_PCLK_EN();
		}else if (pUSARTx == USART2)       // Check if the USART peripheral is USART2
		{
			USART2_PCLK_EN();
		}else if (pUSARTx == USART6)       // Check if the USART peripheral is USART6
		{
			USART6_PCLK_EN();
		}
	}
	else
	{
		if(pUSARTx == USART1)            // Check if the USART peripheral is USART1
		{
			USART1_PCLK_DI();
		}else if (pUSARTx == USART2)    // Check if the USART peripheral is USART2
		{
			USART2_PCLK_DI();
		}else if (pUSARTx == USART6)   // Check if the USART peripheral is USART6
		{
			USART6_PCLK_DI();
		}
	}
}

/*********************** USART_GET_FLAG_STATUS ***************************************
 * @brief  Checks the status of a specific flag in the USART status register
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  StatusFlagName: The specific flag to check (e.g., USART_FLAG_TXE, USART_FLAG_RXNE)
 * @retval Flag status (SET or RESET)
 */
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx, uint8_t StatusFlagName)
{
    if(pUSARTx->SR & StatusFlagName)       // Check if the specified flag is set in the status register(SR_TXE, SR_RXNE, SR_TC)
	{
    	return SET;             
    }

   return RESET;
}

/**********************USART_SEND_DATA ***************************************
 * @brief  Sends data through the specified USART peripheral
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  pSrc: Pointer to the source buffer
 * @param  Len: Number of bytes to send
 * @retval None
 */
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len)   
{

	uint16_t *pdata;                // Temporary pointer for 9-bit data transmission

   //Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)                               
	{
		//Implement the code to wait until TXE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TXE));

		//Check the USART_WordLength item for 9BIT or 8BIT in a frame
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//if 9BIT load the DR with 2bytes masking  the bits other than first 9 bits
			pdata = (uint16_t*) pTxBuffer;                                                 // Typecast the pointer to 16-bit for 9-bit data transmission
			pUSARTHandle->pUSARTx->DR = (*pdata & (uint16_t)0x01FF);                       // Load the data register with the 9-bit data, masking to ensure only the first 9 bits are used

			//check for USART_ParityControl
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used in this transfer , so 9bits of user data will be sent
				//Implement the code to increment pTxBuffer twice
				pTxBuffer++;                                                                 // Increment the buffer address to point to the next byte of data 
				pTxBuffer++;                                                                 // Increment the buffer address again for 9-bit data transmission      
			}
			else
			{
				//Parity bit is used in this transfer . so 8bits of user data will be sent
				//The 9th bit will be replaced by parity bit by the hardware
				pTxBuffer++;                                                                // Increment the buffer address to point to the next byte of data for 8-bit user data transmission
			}
		}
		else
		{
			//This is 8bit data transfer
			pUSARTHandle->pUSARTx->DR = (*pTxBuffer  & (uint8_t)0xFF);                   // Load the data register with the 8-bit data, masking to ensure only the first 8 bits are used

			//Implement the code to increment the buffer address
			pTxBuffer++;
		}
	}

	//Implement the code to wait till TC flag is set in the SR
	while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TC));            // Wait until the transmission is complete (TC flag is set)
}

/**********************USART_RECEIVE_DATA ***************************************
 * @brief  Receives data through the specified USART peripheral
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  pRxBuffer: Pointer to the receive buffer
 * @param  Len: Number of bytes to receive
 * @retval None
 */

 void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len)
{
   //Loop over until "Len" number of bytes are transferred
	for(uint32_t i = 0 ; i < Len; i++)
	{
		//Implement the code to wait until RXNE flag is set in the SR
		while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_RXNE));

		//Check the USART_WordLength to decide whether we are going to receive 9bit of data in a frame or 8 bit
		if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
		{
			//We are going to receive 9bit data in a frame

			//Now, check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used , so all 9bits will be of user data

				//read only first 9 bits so mask the DR with 0x01FF
				*((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->DR  & (uint16_t)0x01FF);

				//Now increment the pRxBuffer two times
				pRxBuffer++;
				pRxBuffer++;
			}
			else
			{
				//Parity is used, so 8bits will be of user data and 1 bit is parity
				 *pRxBuffer = (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
				 pRxBuffer++;
			}
		}
		else
		{
			//We are going to receive 8bit data in a frame

			//Now, check are we using USART_ParityControl control or not
			if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
			{
				//No parity is used , so all 8bits will be of user data

				//read 8 bits from DR
				 *pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0xFF);
			}

			else
			{
				//Parity is used, so , 7 bits will be of user data and 1 bit is parity

				//read only 7 bits , hence mask the DR with 0X7F
				 *pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->DR  & (uint8_t)0x7F);

			}

			//Now , increment the pRxBuffer
			pRxBuffer++;
		}
	}

}

/**********************USART_CLEAR_FLAG ***************************************
 * @brief  Clears the specified USART flag
 * @param  pUSARTx: Pointer to the USART register structure
 * @param  Flag: The flag to clear
 * @retval None
 */

void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName)  
{
	pUSARTx->SR &= ~( StatusFlagName);                   //SR register flags are cleared by writing 0 to them. Writing 1 has no effect.

}
